# -*- coding: Cp1251 -*-

HOLIDAYS = {
	'UA' : (
		( 1,  1,	u"Новий рік"),
		( 1,  7,	u"Різдво Христове"),
		( 3,  8,	u"Міжнародний Жіночий День", 1966),
		( 5,  1,	u"День міжнародної солідарності трудящих"),
		( 5,  2,	u"День міжнародної солідарності трудящих"),
		( 5,  9,	u"День Перемоги", 1945),
		( 6, 28,	u"День Конституції України", 1997),
		( 8, 24,	u"День Незалежності України",  1991),

		(24, 04,    u"Пасха", 2011, 2011),
		(12, 06,    u"Трійця", 2011, 2011),
		
		(15, 04,    u"Пасха", 2012, 2012),
		( 3, 06,    u"Трійця", 2012, 2012),

		( 5, 05,    u"Пасха", 2013, 2013),
		(23, 06,    u"Трійця", 2013, 2013),
	),
	'RU' : (
		( 1,  1,	u"Новый год"),
		( 1,  7,	u"Православное Рождество"),
		( 2, 23,	u"День Защитника Отечества", 2002),
		( 3,  8,	u"Международный Женский День", 1966),
		( 5,  1,	u"Праздника весны и труда"),
		( 5,  9,	u"День Победы", 1945),
		( 6, 12,	u"День России", 1992),
		(11,  4,	u"День народного единства", 2005),
	),
}
