# - *- coding: Cp1251 -*-

from Unit import Unit

ZERO = u"ноль"
MINUS = u"минус"

S20 = (
	[
		None,
		u"один", 
		u"два", 
		u"три",
		u"четыре",
		u"пять",
		u"шесть",
		u"семь",
		u"восемь",
		u"девять",
		u"десять",
		u"одиннадцать",
		u"двенадцать",
		u"тринадцать",
		u"четырнадцать",
		u"пятнадцать",
		u"шестнадцать",
		u"семнадцать",
		u"восемнадцать",
		u"девятнадцать",
	],
	[],
	[],
)

S20[1].extend(S20[0])
S20[2].extend(S20[0])

S20[Unit.FEMALE][1] = u"одна"
S20[Unit.FEMALE][2] = u"две"

S20[Unit.NEUTER][1] = u"одно"
S20[Unit.NEUTER][2] = u"два"

S90 = (
	None,
	None,
	u"двадцать",
	u"тридцать",
	u"сорок",
	u"пятьдесят",
	u"шестьдесят",
	u"семьдесят",
	u"восемьдесят",
	u"девяносто",
)

S900 = (
	None,
	u"сто",
	u"двести",
	u"триста",
	u"четыреста",
	u"пятьсот",
	u"шестьсот",
	u"семьсот",
	u"восемьсот",
	u"девятьсот",
)

UNIT = (
	Unit(Unit.FEMALE,	u"тысяча",		u"тысячи",			u"тысяч"),
	Unit(Unit.MALE,		u"миллион",		u"миллиона",		u"миллионов"),
	Unit(Unit.MALE,		u"миллиард",	u"миллиарда",		u"миллиардов"),
	Unit(Unit.MALE,		u"триллион",	u"триллиона",		u"триллионов"),
	Unit(Unit.MALE,		u"квадриллион",	u"квадриллиона",	u"квадриллионов"),
	Unit(Unit.MALE,		u"квинтиллион",	u"квинтиллиона",	u"квинтиллионов"),
	Unit(Unit.MALE,		u"секстилион",	u"секстилион",		u"секстилионов"),
	Unit(Unit.MALE,		u"септилион",	u"септилиона",		u"септилионов"),
	Unit(Unit.MALE,		u"октилион",	u"октилиона",		u"октилионов"),
	Unit(Unit.MALE,		u"нонилион",	u"нонилиона",		u"нонилионов"),
	Unit(Unit.MALE,		u"децилион",	u"децилиона",		u"децилионов"),
)                   

del Unit
