# - *- coding: Cp1251 -*-

from Unit import Unit

ZERO = u"нуль"
MINUS = u"мінус"

S20 = (
	[
		None,
		u"один", 
		u"два", 
		u"три",
		u"чотири",
		u"п'ять",
		u"шість",
		u"сім",
		u"вісім",
		u"дев'ять",
		u"десять",
		u"одинадцять",
		u"дванадцять",
		u"тринадцять",
		u"чотирнадцять",
		u"п'ятнадцять",
		u"шістнадцять",
		u"сімнадцять",
		u"вісімнадцять",
		u"дев'ятнадцять",
	],
	[],
	[],
)

S20[1].extend(S20[0])
S20[2].extend(S20[0])

S20[Unit.FEMALE][1] = u"одна"
S20[Unit.FEMALE][2] = u"дві"

S20[Unit.NEUTER][1] = u"одне"
S20[Unit.NEUTER][2] = u"два"

S90 = (
	None,
	None,
	u"двадцять",
	u"тридцять",
	u"сорок",
	u"п'ятдесят",
	u"шістдесят",
	u"сімдесят",
	u"вісімдесят",
	u"дев'яносто",
)

S900 = (
	None,
	u"сто",
	u"двісті",
	u"триста",
	u"чотириста",
	u"п'ятсот",
	u"шістсот",
	u"сімсот",
	u"вісімсот",
	u"дев'ятсот",
)

UNIT = (
	Unit(Unit.FEMALE,	u"тисяча",		u"тисячі",			u"тисяч"),
	Unit(Unit.MALE,		u"мільйон",		u"мільйони",		u"мільйонів"),
	Unit(Unit.MALE,		u"мільярд",		u"мільярди",		u"мільярдів"),
	Unit(Unit.MALE,		u"трильйон",	u"трильйони",		u"трильйонів"),
	Unit(Unit.MALE,		u"квадрильйон",	u"квадрильйони",	u"квадрильйонів"),
	Unit(Unit.MALE,		u"квінтильйон",	u"квінтильйони",	u"квінтильйонів"),
	Unit(Unit.MALE,		u"секстильйон",	u"секстильйони",	u"секстильйонів"),
	Unit(Unit.MALE,		u"септильйон",	u"септильйони",		u"септильйонів"),
	Unit(Unit.MALE,		u"октильйон",	u"октильйони",		u"октильйонів"),
	Unit(Unit.MALE,		u"нонильйон",	u"нонильйони",		u"нонильйонів"),
	Unit(Unit.MALE,		u"децильйон",	u"децильйони",		u"децильйонів"),
)                   

del Unit
